{
    "posts": [
        {
            "id": 1,
            "title": "Introducción a Python",
            "text": "Python se ha convertido en uno de los lenguajes de programación más populares. En este post, exploramos sus fundamentos y cómo empezar.",
            "author": "Juan Pérez",
            "publishDate": "2024-02-01",
            "status": "published"
        },
        {
            "id": 2,
            "title": "¿Qué es la Programación Orientada a Objetos?",
            "text": "La Programación Orientada a Objetos (POO) es un paradigma de programación que utiliza objetos y clases en su enfoque. Aprende más sobre ello aquí.",
            "author": "Ana Gómez",
            "publishDate": "2024-02-05",
            "status": "published"
        },
        {
            "id": 3,
            "title": "Primeros pasos en JavaScript",
            "text": "JavaScript es esencial para el desarrollo web. Este post te guiará a través de los conceptos básicos para comenzar a programar con JavaScript.",
            "author": "Carlos López",
            "publishDate": "2024-02-10",
            "status": "published"
        },
        {
            "id": 4,
            "title": "Frameworks de Python: Django vs Flask",
            "text": "Django y Flask son dos de los frameworks de Python más populares. En este post, comparamos sus diferencias y similitudes para ayudarte a elegir el adecuado.",
            "author": "Lucía Martínez",
            "publishDate": "2024-02-15",
            "status": "published"
        },
        {
            "id": 5,
            "title": "Creando tu primera aplicación en React",
            "text": "React es una biblioteca de JavaScript para construir interfaces de usuario. Aprende a crear tu primera aplicación en React con este tutorial paso a paso.",
            "author": "Miguel Ángel Torres",
            "publishDate": "2024-02-20",
            "status": "published"
        },
        {
            "id": 6,
            "title": "Introducción a las bases de datos SQL",
            "text": "Las bases de datos SQL son fundamentales para el desarrollo de software. Este post introduce los conceptos básicos de SQL y cómo empezar a usarlo.",
            "author": "Sofía Navarro",
            "publishDate": "2024-02-25",
            "status": "published"
        },
        {
            "id": 7,
            "title": "Mejores prácticas en el desarrollo de software",
            "text": "Adoptar las mejores prácticas es crucial para el éxito del desarrollo de software. Este post cubre algunas de las más importantes.",
            "author": "Diego Fernández",
            "publishDate": "2024-03-02",
            "status": "published"
        },
        {
            "id": 8,
            "title": "La importancia de Git en el control de versiones",
            "text": "Git es una herramienta esencial para el control de versiones en el desarrollo de software. Aprende por qué es tan importante y cómo empezar a usarlo.",
            "author": "Laura Jiménez",
            "publishDate": "2024-03-05",
            "status": "published"
        },
        {
            "id": 9,
            "title": "Desarrollo de aplicaciones móviles: iOS vs Android",
            "text": "El desarrollo de aplicaciones móviles puede enfocarse en iOS o Android. Este post examina las diferencias entre ambos y cómo elegir la mejor opción.",
            "author": "Roberto García",
            "publishDate": "2024-03-10",
            "status": "published"
        },
        {
            "id": 10,
            "title": "Seguridad informática para programadores",
            "text": "La seguridad informática es crucial en el desarrollo de software. Este post ofrece una introducción a las prácticas de seguridad esenciales para programadores.",
            "author": "Elena Sánchez",
            "publishDate": "2024-03-15",
            "status": "published"
        }
    ]
}